//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Schritt %d von %d durchführen: Entity Store aufbauen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Schritt %d von %d durchführen: Anlegen der Bootstrap-Datenbank";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Schritt %d von %d durchführen: Anlegen der Request-Queue-Datenbank";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Schritt %d von %d durchführen: Herunterladen des Entity Store. Bisher %s von %s empfangen.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Schritt %d von %d durchführen: Löschen abgelaufener Anforderungen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Schritt %d von %d durchführen: Laden der Metadaten";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Schritt %d von %d durchführen: Durchführen der Request-Queue-Zusammenführung";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Schritt %d von %d durchführen: Durchführen der Transaktionszusammenführung";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Schritt %d von %d durchführen: Anlegen/Löschen der Zusammenführung durchführen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Schritt %d von %d durchführen: Verarbeitung der Definierung von Abfragen %s über %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Schritt %d von %d durchführen: Verarbeitung von Anforderungen. Senden der Änderungsanfroderung %s von %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Schritt %d von %d durchführen: Erneutes Anwenden der Änderungen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Schritt %d von %d durchführen: Analyse empfangener Daten";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Schritt %d von %d durchführen: Erhalt der Daten vom Server. Bisher %s erhalten.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Schritt %d von %d durchführen: Entfernen gelöschter Beziehungen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Schritt %d von %d durchführen: Entfernen von als RemoveAfterUpload festgelegter Anforderungen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Schritt %d von %d durchführen: Senden der Daten an den Server. Bisher %s erhalten.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Schritt %d von %d durchführen: Senden der Entity-Store-Datenbank. Bisher %s von %s gesendet.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Schritt %d von %d durchführen: Senden der Request-Queue-Datenbank. Bisher %s von %s gesendet.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Schritt %d von %d durchführen: Beginn der Kommunikation mit dem Server";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Schritt %d von %d durchführen: Vorverarbeitung der Anforderungen vor dem Hochladen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Schritt %d von %d durchführen: Warte auf Download";

